Repository: flowsydev/flowsy-net-event-sourcing-sql
Catalog: Flowsy.EventSourcing.Sql/Resources/Strings.*.resx
Languages: es

# ConfigurationNotFoundForType
source: Configuration not found fot type: {0}.
es: Configuración no encontrada para el tipo: {0}.

# EventRecordVersionNotSupported
source: Event record version not supported: {0}.
es: Versión de registro de evento no soportada: {0}.

source: Event record version not specified.
es: Versión del registro de evento no especificada.

source: Event metadata not found.
es: No se encontraron metadatos del evento.

source: Could not read event metadata.
es: No se pudieron leer los metadatos del evento.

source: Could not read event payload.
es: No se pudieron leer los datos del evento.

# TypeNotFound
source: Type not found: {0}.
es: Tipo no encontrado: {0}.

source: Event payload not found.
es: No se encontraron los datos del evento.

# InvalidEventTimestamp
source: Invalid event timestamp: {0}.
es: Marca de tiempo no válida para el evento: {0}.

# PersistenceOperationActiveMustBeCompleted
source: A persistence operation is active and must be completed before beginning a new one.
es: Una operación de persistencia está activa y debe completarse antes de iniciar una nueva.

# PersistenceOperationMustBeStartedAndEventsMustBeStored
source: A persistence operation must be started and events must be stored before saving changes.
es: Es necesario iniciar una operación de persistencia y almacenar eventos antes de guardar cambios.
